Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFG144.atdf
         <module id="01643" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph_indep" name="PCACHE" name-in-module="PCACHE" offset="0x1f8e0000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00751" name="PMP" version="">
            <instance name="PMP">
               <register-group address-space="periph_pb2_std" name="PMP" name-in-module="PMP" offset="0x1f82e000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00159" name="RNG" version="">
            <instance name="RNG">
               <register-group address-space="periph_indep" name="RNG" name-in-module="RNG" offset="0x1f8e6000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="01423" name="RPIN" version="">
            <instance name="RPIN">
               <register-group address-space="periph_pb1_std" name="RPIN" name-in-module="RPIN" offset="0x1f801404"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="01423" name="RPOUT" version="">
            <instance name="RPOUT">
               <register-group address-space="periph_pb1_std" name="RPOUT" name-in-module="RPOUT" offset="0x1f801538"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00748" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph_pb1_std" name="RTCC" name-in-module="RTCC" offset="0x1f800c00"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00136" name="SB" version="">
            <instance name="SB">
               <register-group address-space="periph_ssx" name="SB" name-in-module="SB" offset="0x1f8f0510"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph_pb2_std" name="SPI" name-in-module="SPI" offset="0x1f821000"/>
               <parameters>
                  <param name=""/>
               </parameters>
           </instance>
            <instance name="SPI2"/>
            <instance name="SPI3"/>
            <instance name="SPI4"/>
            <instance name="SPI5"/>
            <instance name="SPI6"/>
         </module>
         <module id="00206" name="SQI" version="">
            <instance name="SQI1">
               <register-group address-space="periph_indep" name="SQI" name-in-module="SQI1" offset="0x1f8e2000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00687" name="TMR1" version="">
            <instance name="TMR1">
               <register-group address-space="periph_pb3_std" name="TMR1" name-in-module="TMR1" offset="0x1f840000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00745" name="TMR" version="">
                  <instance name="TMR2">
               <register-group address-space="periph_pb3_std" name="TMR2" name-in-module="TMR2" offset="0x1f840200"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
            <instance name="TMR3"/>
            <instance name="TMR4"/>
            <instance name="TMR5"/>
            <instance name="TMR6"/>
            <instance name="TMR7"/>
            <instance name="TMR8"/>
            <instance name="TMR9"/>
         </module>
         <module id="00734" name="UART" version="">
            <instance name="UART1">
               <register-group address-space="periph_pb2_std" name="UART" name-in-module="UART" offset="0x1f822000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
            <instance name="UART2"/>
            <instance name="UART3"/>
            <instance name="UART4"/>
            <instance name="UART5"/>
            <instance name="UART6"/>
         </module>
         <module id="00124" name="USB" version="">
            <instance name="USB">
               <register-group address-space="periph_indep" name="USB" name-in-module="USB" offset="0x1f8e3000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="02831" name="USBCLKRST" version="">
            <instance name="USBCLKRST">
               <register-group address-space="periph_pb5_std" name="USBCLKRST" name-in-module="USBCLKRST" offset="0x1f8e4000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="02674" name="WDT" version="">
            <instance name="WDT">
               <register-group address-space="periph_pb1_std" name="WDT" name-in-module="WDT" offset="0x1f800800"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
      </peripherals>
      <interrupts>
         <interrupt caption="Core Timer" index="0" name="CORE_TIMER"/>
         <interrupt caption="Core Software 0" index="1" name="CORE_SOFTWARE_0"/>
         <interrupt caption="Core Software 1" index="2" name="CORE_SOFTWARE_1"/>
         <interrupt caption="Ext INT 0" index="3" module-instance="EXTERNAL_0" name="EXTERNAL_0"/>
         <interrupt caption="Timer1" index="4" module-instance="TIMER_1" name="TIMER_1"/>
         <interrupt caption="Input Capture 1 Error" index="5" module-instance="INPUT_CAPTURE_1_ERROR" name="INPUT_CAPTURE_1_ERROR"/>
         <interrupt caption="Input Capture 1" index="6" module-instance="INPUT_CAPTURE_1" name="INPUT_CAPTURE_1"/>
         <interrupt caption="Output Compare 1" index="7" module-instance="OUTPUT_COMPARE_1" name="OUTPUT_COMPARE_1"/>
         <interrupt caption="Ext INT 1" index="8" module-instance="EXTERNAL_1" name="EXTERNAL_1"/>
         <interrupt caption="Timer2" index="9" module-instance="TIMER_2" name="TIMER_2"/>
         <interrupt caption="Input Capture 2 Error" index="10" module-instance="INPUT_CAPTURE_2_ERROR" name="INPUT_CAPTURE_2_ERROR"/>
         <interrupt caption="Input Capture 2" index="11" module-instance="INPUT_CAPTURE_2" name="INPUT_CAPTURE_2"/>
         <interrupt caption="Output Compare 2" index="12" module-instance="OUTPUT_COMPARE_2" name="OUTPUT_COMPARE_2"/>
         <interrupt caption="Ext INT 2" index="13" module-instance="EXTERNAL_2" name="EXTERNAL_2"/>
         <interrupt caption="Timer3" index="14" module-instance="TIMER_3" name="TIMER_3"/>
         <interrupt caption="Input Capture 3 Error" index="15" module-instance="INPUT_CAPTURE_3_ERROR" name="INPUT_CAPTURE_3_ERROR"/>
         <interrupt caption="Input Capture 3" index="16" module-instance="INPUT_CAPTURE_3" name="INPUT_CAPTURE_3"/>
         <interrupt caption="Output Compare 3" index="17" module-instance="OUTPUT_COMPARE_3" name="OUTPUT_COMPARE_3"/>
         <interrupt caption="Ext INT 3" index="18" module-instance="EXTERNAL_3" name="EXTERNAL_3"/>
         <interrupt caption="Timer4" index="19" module-instance="TIMER_4" name="TIMER_4"/>
         <interrupt caption="Input Capture 4 Error" index="20" module-instance="INPUT_CAPTURE_4_ERROR" name="INPUT_CAPTURE_4_ERROR"/>
         <interrupt caption="Input Capture 4" index="21" module-instance="INPUT_CAPTURE_4" name="INPUT_CAPTURE_4"/>
         <interrupt caption="Output Compare 4" index="22" module-instance="OUTPUT_COMPARE_4" name="OUTPUT_COMPARE_4"/>
         <interrupt caption="Ext INT 4" index="23" module-instance="EXTERNAL_4" name="EXTERNAL_4"/>
         <interrupt caption="Timer5" index="24" module-instance="TIMER_5" name="TIMER_5"/>
         <interrupt caption="Input Capture 5 Error" index="25" module-instance="INPUT_CAPTURE_5_ERROR" name="INPUT_CAPTURE_5_ERROR"/>
         <interrupt caption="Input Capture 5" index="26" module-instance="INPUT_CAPTURE_5" name="INPUT_CAPTURE_5"/>
         <interrupt caption="Output Compare 5" index="27" module-instance="OUTPUT_COMPARE_5" name="OUTPUT_COMPARE_5"/>
         <interrupt caption="Timer6" index="28" module-instance="TIMER_6" name="TIMER_6"/>
         <interrupt caption="Input Capture 6 Error" index="29" module-instance="INPUT_CAPTURE_6_ERROR" name="INPUT_CAPTURE_6_ERROR"/>
         <interrupt caption="Input Capture 6" index="30" module-instance="INPUT_CAPTURE_6" name="INPUT_CAPTURE_6"/>
         <interrupt caption="Output Compare 6" index="31" module-instance="OUTPUT_COMPARE_6" name="OUTPUT_COMPARE_6"/>
         <interrupt caption="Timer7" index="32" module-instance="TIMER_7" name="TIMER_7"/>
         <interrupt caption="Input Capture 7 Error" index="33" module-instance="INPUT_CAPTURE_7_ERROR" name="INPUT_CAPTURE_7_ERROR"/>
         <interrupt caption="Input Capture 7" index="34" module-instance="INPUT_CAPTURE_7" name="INPUT_CAPTURE_7"/>
         <interrupt caption="Output Compare 7" index="35" module-instance="OUTPUT_COMPARE_7" name="OUTPUT_COMPARE_7"/>
         <interrupt caption="Timer8" index="36" module-instance="TIMER_8" name="TIMER_8"/>
         <interrupt caption="Input Capture 8 Error" index="37" module-instance="INPUT_CAPTURE_8_ERROR" name="INPUT_CAPTURE_8_ERROR"/>
         <interrupt caption="Input Capture 8" index="38" module-instance="INPUT_CAPTURE_8" name="INPUT_CAPTURE_8"/>
         <interrupt caption="Output Compare 8" index="39" module-instance="OUTPUT_COMPARE_8" name="OUTPUT_COMPARE_8"/>
         <interrupt caption="Timer9" index="40" module-instance="TIMER_9" name="TIMER_9"/>
         <interrupt caption="Input Capture 9 Error" index="41" module-instance="INPUT_CAPTURE_9_ERROR" name="INPUT_CAPTURE_9_ERROR"/>
         <interrupt caption="Input Capture 9" index="42" module-instance="INPUT_CAPTURE_9" name="INPUT_CAPTURE_9"/>
         <interrupt caption="Output Compare 9" index="43" module-instance="OUTPUT_COMPARE_9" name="OUTPUT_COMPARE_9"/>
         <interrupt caption="ADC Global" index="44" name="ADC"/>
         <interrupt caption="ADC FIFO" index="45" name="ADC_FIFO"/>
         <interrupt caption="ADC Digital Comparator 1" index="46" module-instance="ADC_DC1" name="ADC_DC1"/>
         <interrupt caption="ADC Digital Comparator 2" index="47" module-instance="ADC_DC2" name="ADC_DC2"/>
         <interrupt caption="ADC Digital Comparator 3" index="48" module-instance="ADC_DC3" name="ADC_DC3"/>
         <interrupt caption="ADC Digital Comparator 4" index="49" module-instance="ADC_DC4" name="ADC_DC4"/>
         <interrupt caption="ADC Digital Comparator 5" index="50" module-instance="ADC_DC5" name="ADC_DC5"/>
         <interrupt caption="ADC Digital Comparator 6" index="51" module-instance="ADC_DC6" name="ADC_DC6"/>
         <interrupt caption="ADC Digital Filter 1" index="52" module-instance="ADC_DF1" name="ADC_DF1"/>
         <interrupt caption="ADC Digital Filter 2" index="53" module-instance="ADC_DF2" name="ADC_DF2"/>
         <interrupt caption="ADC Digital Filter 3" index="54" module-instance="ADC_DF3" name="ADC_DF3"/>
         <interrupt caption="ADC Digital Filter 4" index="55" module-instance="ADC_DF4" name="ADC_DF4"/>
         <interrupt caption="ADC Digital Filter 5" index="56" module-instance="ADC_DF5" name="ADC_DF5"/>
         <interrupt caption="ADC Digital Filter 6" index="57" module-instance="ADC_DF6" name="ADC_DF6"/>
         <interrupt caption="ADC Fault" index="58" name="ADC_FAULT"/>
         <interrupt caption="ADC Data 0" index="59" module-instance="ADC_DATA0" name="ADC_DATA0"/>
         <interrupt caption="ADC Data 1" index="60" module-instance="ADC_DATA1" name="ADC_DATA1"/>
         <interrupt caption="ADC Data 2" index="61" module-instance="ADC_DATA2" name="ADC_DATA2"/>
         <interrupt caption="ADC Data 3" index="62" module-instance="ADC_DATA3" name="ADC_DATA3"/>
         <interrupt caption="ADC Data 4" index="63" module-instance="ADC_DATA4" name="ADC_DATA4"/>
         <interrupt caption="ADC Data 5" index="64" module-instance="ADC_DATA5" name="ADC_DATA5"/>
         <interrupt caption="ADC Data 6" index="65" module-instance="ADC_DATA6" name="ADC_DATA6"/>
         <interrupt caption="ADC Data 7" index="66" module-instance="ADC_DATA7" name="ADC_DATA7"/>
         <interrupt caption="ADC Data 8" index="67" module-instance="ADC_DATA8" name="ADC_DATA8"/>
         <interrupt caption="ADC Data 9" index="68" module-instance="ADC_DATA9" name="ADC_DATA9"/>
         <interrupt caption="ADC Data 10" index="69" module-instance="ADC_DATA10" name="ADC_DATA10"/>
         <interrupt caption="ADC Data 11" index="70" module-instance="ADC_DATA11" name="ADC_DATA11"/>
         <interrupt caption="ADC Data 12" index="71" module-instance="ADC_DATA12" name="ADC_DATA12"/>
         <interrupt caption="ADC Data 13" index="72" module-instance="ADC_DATA13" name="ADC_DATA13"/>
         <interrupt caption="ADC Data 14" index="73" module-instance="ADC_DATA14" name="ADC_DATA14"/>
         <interrupt caption="ADC Data 15" index="74" module-instance="ADC_DATA15" name="ADC_DATA15"/>
         <interrupt caption="ADC Data 16" index="75" module-instance="ADC_DATA16" name="ADC_DATA16"/>
         <interrupt caption="ADC Data 17" index="76" module-instance="ADC_DATA17" name="ADC_DATA17"/>
         <interrupt caption="ADC Data 18" index="77" module-instance="ADC_DATA18" name="ADC_DATA18"/>
         <interrupt caption="ADC Data 19" index="78" module-instance="ADC_DATA19" name="ADC_DATA19"/>
         <interrupt caption="ADC Data 20" index="79" module-instance="ADC_DATA20" name="ADC_DATA20"/>
         <interrupt caption="ADC Data 21" index="80" module-instance="ADC_DATA21" name="ADC_DATA21"/>
         <interrupt caption="ADC Data 22" index="81" module-instance="ADC_DATA22" name="ADC_DATA22"/>
         <interrupt caption="ADC Data 23" index="82" module-instance="ADC_DATA23" name="ADC_DATA23"/>
         <interrupt caption="ADC Data 24" index="83" module-instance="ADC_DATA24" name="ADC_DATA24"/>
         <interrupt caption="ADC Data 25" index="84" module-instance="ADC_DATA25" name="ADC_DATA25"/>
         <interrupt caption="ADC Data 26" index="85" module-instance="ADC_DATA26" name="ADC_DATA26"/>
         <interrupt caption="ADC Data 27" index="86" module-instance="ADC_DATA27" name="ADC_DATA27"/>
         <interrupt caption="ADC Data 28" index="87" module-instance="ADC_DATA28" name="ADC_DATA28"/>
         <interrupt caption="ADC Data 29" index="88" module-instance="ADC_DATA29" name="ADC_DATA29"/>
         <interrupt caption="ADC Data 30" index="89" module-instance="ADC_DATA30" name="ADC_DATA30"/>
         <interrupt caption="ADC Data 31" index="90" module-instance="ADC_DATA31" name="ADC_DATA31"/>
         <interrupt caption="ADC Data 32" index="91" module-instance="ADC_DATA32" name="ADC_DATA32"/>
         <interrupt caption="ADC Data 33" index="92" module-instance="ADC_DATA33" name="ADC_DATA33"/>
         <interrupt caption="ADC Data 34" index="93" module-instance="ADC_DATA34" name="ADC_DATA34"/>
         <interrupt caption="ADC Data 35" index="94" module-instance="ADC_DATA35" name="ADC_DATA35"/>
         <interrupt caption="ADC Data 36" index="95" module-instance="ADC_DATA36" name="ADC_DATA36"/>
         <interrupt caption="ADC Data 37" index="96" module-instance="ADC_DATA37" name="ADC_DATA37"/>
         <interrupt caption="ADC Data 38" index="97" module-instance="ADC_DATA38" name="ADC_DATA38"/>
         <interrupt caption="ADC Data 39" index="98" module-instance="ADC_DATA39" name="ADC_DATA39"/>
         <interrupt caption="ADC Data 40" index="99" module-instance="ADC_DATA40" name="ADC_DATA40"/>
         <interrupt caption="ADC Data 41" index="100" module-instance="ADC_DATA41" name="ADC_DATA41"/>
         <interrupt caption="ADC Data 42" index="101" module-instance="ADC_DATA42" name="ADC_DATA42"/>
         <interrupt caption="ADC Data 43" index="102" module-instance="ADC_DATA43" name="ADC_DATA43"/>
         <interrupt caption="ADC Data 44" index="103" module-instance="ADC_DATA44" name="ADC_DATA44"/>
         <interrupt caption="Core Performance Counter" index="104" name="CORE_PERF_COUNT"/>
         <interrupt caption="Core Fast Debug Channel" index="105" name="CORE_FAST_DEBUG_CHAN"/>
         <interrupt caption="System Bus Protection Violation" index="106" name="SYSTEM_BUS_PROTECTION"/>
         <interrupt caption="SPI1 Fault" index="109" module-instance="SPI1_FAULT" name="SPI1_FAULT"/>
         <interrupt caption="SPI1 Receive Done" index="110" module-instance="SPI1_RX" name="SPI1_RX"/>
         <interrupt caption="SPI1 Transmit Done" index="111" module-instance="SPI1_TX" name="SPI1_TX"/>
         <interrupt caption="UART1 Fault" index="112" module-instance="UART1_FAULT" name="UART1_FAULT"/>
         <interrupt caption="UART1 Receive Done" index="113" module-instance="UART1_RX" name="UART1_RX"/>
         <interrupt caption="UART1 Transmit Done" index="114" module-instance="UART1_TX" name="UART1_TX"/>
         <interrupt caption="I2C1 Bus Collision Event" index="115" module-instance="I2C1_BUS" name="I2C1_BUS"/>
         <interrupt caption="I2C1 Slave Event" index="116" module-instance="I2C1_SLAVE" name="I2C1_SLAVE"/>
         <interrupt caption="I2C1 Master Event" index="117" module-instance="I2C1_MASTER" name="I2C1_MASTER"/>
         <interrupt caption="PORTA Input Change" index="118" module-instance="CHANGE_NOTICE_A" name="CHANGE_NOTICE_A"/>
         <interrupt caption="PORTB Input Change" index="119" module-instance="CHANGE_NOTICE_B" name="CHANGE_NOTICE_B"/>
         <interrupt caption="PORTC Input Change" index="120" module-instance="CHANGE_NOTICE_C" name="CHANGE_NOTICE_C"/>
         <interrupt caption="PORTD Input Change" index="121" module-instance="CHANGE_NOTICE_D" name="CHANGE_NOTICE_D"/>
         <interrupt caption="PORTE Input Change" index="122" module-instance="CHANGE_NOTICE_E" name="CHANGE_NOTICE_E"/>
         <interrupt caption="PORTF Input Change" index="123" module-instance="CHANGE_NOTICE_F" name="CHANGE_NOTICE_F"/>
         <interrupt caption="PORTG Input Change" index="124" module-instance="CHANGE_NOTICE_G" name="CHANGE_NOTICE_G"/>
         <interrupt caption="PORTH Input Change" index="125" module-instance="CHANGE_NOTICE_H" name="CHANGE_NOTICE_H"/>
         <interrupt caption="PORTJ Input Change" index="126" module-instance="CHANGE_NOTICE_J" name="CHANGE_NOTICE_J"/>
         <interrupt caption="PORTK Input Change" index="127" name="CHANGE_NOTICE_K"/>
         <interrupt caption="Parallel Master Port" index="128" name="PMP"/>
         <interrupt caption="Parallel Master Port Error" index="129" name="PMP_ERROR"/>
         <interrupt caption="Comparator 1" index="130" module-instance="COMPARATOR_1" name="COMPARATOR_1"/>
         <interrupt caption="Comparator 2" index="131" module-instance="COMPARATOR_2" name="COMPARATOR_2"/>
         <interrupt caption="USB General Event" index="132" name="USB"/>
         <interrupt caption="USB DMA Event" index="133" name="USB_DMA"/>
         <interrupt caption="DMA Channel 0" index="134" module-instance="DMA0" name="DMA0"/>
         <interrupt caption="DMA Channel 1" index="135" module-instance="DMA1" name="DMA1"/>
         <interrupt caption="DMA Channel 2" index="136" module-instance="DMA2" name="DMA2"/>
         <interrupt caption="DMA Channel 3" index="137" module-instance="DMA3" name="DMA3"/>
         <interrupt caption="DMA Channel 4" index="138" module-instance="DMA4" name="DMA4"/>
         <interrupt caption="DMA Channel 5" index="139" module-instance="DMA5" name="DMA5"/>
         <interrupt caption="DMA Channel 6" index="140" module-instance="DMA6" name="DMA6"/>
         <interrupt caption="DMA Channel 7" index="141" module-instance="DMA7" name="DMA7"/>
         <interrupt caption="SPI2 Fault" index="142" module-instance="SPI2_FAULT" name="SPI2_FAULT"/>
         <interrupt caption="SPI2 Receive Done" index="143" module-instance="SPI2_RX" name="SPI2_RX"/>
         <interrupt caption="SPI2 Transmit Done" index="144" module-instance="SPI2_TX" name="SPI2_TX"/>
         <interrupt caption="UART2 Fault" index="145" module-instance="UART2_FAULT" name="UART2_FAULT"/>
         <interrupt caption="UART2 Receive Done" index="146" module-instance="UART2_RX" name="UART2_RX"/>
         <interrupt caption="UART2 Transmit Done" index="147" module-instance="UART2_TX" name="UART2_TX"/>
         <interrupt caption="I2C2 Bus Collision Event" index="148" module-instance="I2C2_BUS" name="I2C2_BUS"/>
         <interrupt caption="I2C2 Slave Event" index="149" module-instance="I2C2_SLAVE" name="I2C2_SLAVE"/>
         <interrupt caption="I2C2 Master Event" index="150" module-instance="I2C2_MASTER" name="I2C2_MASTER"/>
         <interrupt caption="Ethernet" index="153" name="ETHERNET"/>
         <interrupt caption="SPI3 Fault" index="154" module-instance="SPI3_FAULT" name="SPI3_FAULT"/>
         <interrupt caption="SPI3 Receive Done" index="155" module-instance="SPI3_RX" name="SPI3_RX"/>
         <interrupt caption="SPI3 Transmit Done" index="156" module-instance="SPI3_TX" name="SPI3_TX"/>
         <interrupt caption="UART3 Fault" index="157" module-instance="UART3_FAULT" name="UART3_FAULT"/>
         <interrupt caption="UART3 Receive Done" index="158" module-instance="UART3_RX" name="UART3_RX"/>
         <interrupt caption="UART3 Transmit Done" index="159" module-instance="UART3_TX" name="UART3_TX"/>
         <interrupt caption="I2C3 Bus Collision Event" index="160" module-instance="I2C3_BUS" name="I2C3_BUS"/>
         <interrupt caption="I2C3 Slave Event" index="161" module-instance="I2C3_SLAVE" name="I2C3_SLAVE"/>
         <interrupt caption="I2C3 Master Event" index="162" module-instance="I2C3_MASTER" name="I2C3_MASTER"/>
         <interrupt caption="SPI4 Fault" index="163" module-instance="SPI4_FAULT" name="SPI4_FAULT"/>
         <interrupt caption="SPI4 Receive Done" index="164" module-instance="SPI4_RX" name="SPI4_RX"/>
         <interrupt caption="SPI4 Transmit Done" index="165" module-instance="SPI4_TX" name="SPI4_TX"/>
         <interrupt caption="Real Time Clock" index="166" name="RTCC"/>
         <interrupt caption="Flash Control Event" index="167" name="FLASH_CONTROL"/>
         <interrupt caption="Prefetch Module SEC Event" index="168" name="PREFETCH"/>
         <interrupt caption="SQI1 Event" index="169" name="SQI1"/>
         <interrupt caption="UART4 Fault" index="170" module-instance="UART4_FAULT" name="UART4_FAULT"/>
         <interrupt caption="UART4 Receive Done" index="171" module-instance="UART4_RX" name="UART4_RX"/>
         <interrupt caption="UART4 Transmit Done" index="172" module-instance="UART4_TX" name="UART4_TX"/>
         <interrupt caption="I2C4 Bus Collision Event" index="173" module-instance="I2C4_BUS" name="I2C4_BUS"/>
         <interrupt caption="I2C4 Slave Event" index="174" module-instance="I2C4_SLAVE" name="I2C4_SLAVE"/>
         <interrupt caption="I2C4 Master Event" index="175" module-instance="I2C4_MASTER" name="I2C4_MASTER"/>
         <interrupt caption="SPI5 Fault" index="176" module-instance="SPI5_FAULT" name="SPI5_FAULT"/>
         <interrupt caption="SPI5 Receive Done" index="177" module-instance="SPI5_RX" name="SPI5_RX"/>
         <interrupt caption="SPI5 Transmit Done" index="178" module-instance="SPI5_TX" name="SPI5_TX"/>
