Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFG144.atdf
         <register caption="" name="CNPDJ" offset="0x860" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDJ0"/>
            <bitfield mask="0x00000002" name="CNPDJ1"/>
            <bitfield mask="0x00000004" name="CNPDJ2"/>
            <bitfield mask="0x00000008" name="CNPDJ3"/>
            <bitfield mask="0x00000010" name="CNPDJ4"/>
            <bitfield mask="0x00000020" name="CNPDJ5"/>
            <bitfield mask="0x00000040" name="CNPDJ6"/>
            <bitfield mask="0x00000080" name="CNPDJ7"/>
            <bitfield mask="0x00000100" name="CNPDJ8"/>
            <bitfield mask="0x00000200" name="CNPDJ9"/>
            <bitfield mask="0x00000400" name="CNPDJ10"/>
            <bitfield mask="0x00000800" name="CNPDJ11"/>
            <bitfield mask="0x00001000" name="CNPDJ12"/>
            <bitfield mask="0x00002000" name="CNPDJ13"/>
            <bitfield mask="0x00004000" name="CNPDJ14"/>
            <bitfield mask="0x00008000" name="CNPDJ15"/>
         </register>
         <register caption="" name="CNPDK" offset="0x960" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDK0"/>
            <bitfield mask="0x00000002" name="CNPDK1"/>
            <bitfield mask="0x00000004" name="CNPDK2"/>
            <bitfield mask="0x00000008" name="CNPDK3"/>
            <bitfield mask="0x00000010" name="CNPDK4"/>
            <bitfield mask="0x00000020" name="CNPDK5"/>
            <bitfield mask="0x00000040" name="CNPDK6"/>
            <bitfield mask="0x00000080" name="CNPDK7"/>
            <bitfield mask="0x00000100" name="CNPDK8"/>
            <bitfield mask="0x00000200" name="CNPDK9"/>
            <bitfield mask="0x00000400" name="CNPDK10"/>
            <bitfield mask="0x00000800" name="CNPDK11"/>
            <bitfield mask="0x00001000" name="CNPDK12"/>
            <bitfield mask="0x00002000" name="CNPDK13"/>
            <bitfield mask="0x00004000" name="CNPDK14"/>
            <bitfield mask="0x00008000" name="CNPDK15"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONA" offset="0x70" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONA__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONA__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONB" offset="0x170" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONB__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONB__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONC" offset="0x270" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONC__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONC__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCOND" offset="0x370" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCOND__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCOND__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONE" offset="0x470" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONE__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONE__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONF" offset="0x570" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONF__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONF__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONG" offset="0x670" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONG__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONG__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONH" offset="0x770" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONH__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONH__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONJ" offset="0x870" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONJ__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONJ__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONK" offset="0x970" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONK__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONK__ON"/>
         </register>
